/*علي المؤيد + محمد زيد 
هندسة برمجيات سنة 3 

اسم المشروع
Library Management System
الوصف
هذا الكود يمثل نظام إدارة مكتبة بسيط مكتوب بلغة Java،
 ويعتمد على القوائم المرتبطة الأحادية (Single Linked List)
  لتخزين الكتب وتنفيذ العمليات عليها.
يتيح النظام للمستخدم إضافة الكتب، حذفها، البحث عنها، عرضها، فرزها حسب رقم الكتاب،
 بالإضافة إلى استعارة الكتب وإرجاعها.
كما يقوم النظام بتسجيل جميع العمليات التي تتم على المكتبة وعرضها عند الطلب،
من خلال قائمة تفاعلية سهلة الاستخدام عبر شاشة الأوامر

*/



package LibraryLinkedList;
public class Main {
    public static void main(String[] args) {
        LibraryMenu menu = new LibraryMenu();
        menu.start();
    }
}